Tekla Open API Reference for Tekla Structures 2025
RebarPropertyModifier.RebarProperties Property
 Gets or sets the reinforcing bar properties.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarPropertiesNullable RebarProperties { get; set; }
Public Property RebarProperties As RebarPropertiesNullable
	Get
	Set
Property Value
Type: RebarPropertiesNullable
See Also
Reference
RebarPropertyModifier Class
Tekla.Structures.Model Namespace